app/Controllers/UserController.php

    public function sendotp($seg = false){
        $response = [];
        $inputs = $this->validate([
			'mobile_number' => 'required|min_length[10]|max_length[10]'
		]);

		if (!$inputs) {
            $response = ['status'=> false, 'data' => '<h5>Please enter Valid Mobile Number</h5>'];
            $response_json = json_encode($response);
			return $response_json;
		}
        $mobile_number = $this->request->getVar('mobile_number');

        // $apiKey = urlencode('YOUR_API_KEY');
        // $Textlocal = new Textlocal(false, false, $apiKey);
        $sender = 'PHPPOT';
        $otp = rand(100000, 999999);
        $message = "Your One Time Password is " . $otp;
        $user = $this->user->where(['mobile'=> $mobile_number,'access'=> 0])->first();

        if(!empty($user) && $user['mobile'] == $mobile_number){
            $user_update = $this->user->where('mobile', $mobile_number)//->first()
                    ->set('mobile_otp',$otp)
                    ->update();
---
SELECT *
FROM `users`
WHERE `mobile` = '9876543212'
AND `access` = 0
 LIMIT 1
UPDATE `users` SET `mobile_otp` = 211873
WHERE `mobile` = '9876543212'

    public function verifyotp($seg = false){
        $inputs = $this->validate([
			'otp' => 'required|min_length[6]|max_length[6]',
			'action' => 'required',
		]);

		if (!$inputs) {
			$response = ['status'=> false, 'data' => '<h5>OTP not match</h5>'];
            $response_json = json_encode($response);
			return $response_json;
		}
        $otp = $this->request->getVar('otp');
        $user = $this->user->where(['mobile_otp'=> $otp,'access'=> 0])->first();
---
SELECT *
FROM `users`
WHERE `mobile_otp` = '211873'
AND `access` = 0
 LIMIT 1